"1 106 1 4206624770 ,"
"0 1 3 160 160 ,"
" 0 110 116 117 118 119 120 122 123 124 125 132 136 138 139 141 146 154 155 156 158 159 160 161 168 172 174 175 177 182 190 191 192 194 195 196 197 198 200 201 207 208 214 216 217 223 224 231 235 237 238 240 245 253 254 260 262 263 269 270 277 281 283 284 286 291 299 300 306 308 309 310 311 312 313 315 316 317 318 319 321 322 323 329 330 337 341 343 344 346 351 359 360 366 368 369 370 376 377 378 379 380 381 382 383 384 ,"
"384 ,"
" 105 ,"
"Convolution 110 1 1 0 110 1 3 4 3 3 2 2 1 1 1 -1 1 1 ,"
"HardSwish 116 1 1 110 116 0.166667 0.5 ,"
"Convolution 117 1 1 116 117 1 4 24 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 118 1 1 117 118 ,"
"Convolution 119 1 1 118 119 24 1 24 3 3 2 2 1 1 0 -1 1 1 ,"
"ReLU 120 1 1 119 120 ,"
"Convolution 122 1 1 120 122 1 24 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 123 1 1 122 123 1 8 48 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 124 1 1 123 124 ,"
"Convolution 125 1 1 124 125 48 1 48 3 3 2 2 1 1 0 -1 1 1 ,"
"Pooling 132 1 1 125 132 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 136 1 1 132 136 0 4 4 0 48 1 1 ,"
"InnerProduct 138 1 1 136 138 12 1 0 1 ,"
"ReLU 139 1 1 138 139 ,"
"InnerProduct 141 1 1 139 141 48 1 0 1 ,"
"HardSigmoid 146 1 1 141 146 0.166667 0.5 ,"
"Reshape 154 1 1 146 154 0 4 4 0 48 1 1 ,"
"Mul 155 2 1 125 154 155 ,"
"ReLU 156 1 1 155 156 ,"
"Convolution 158 1 1 156 158 1 48 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 159 1 1 158 159 1 16 96 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 160 1 1 159 160 ,"
"Convolution 161 1 1 160 161 96 1 96 3 3 1 1 1 1 0 -1 1 1 ,"
"Pooling 168 1 1 161 168 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 172 1 1 168 172 0 4 4 0 96 1 1 ,"
"InnerProduct 174 1 1 172 174 24 1 0 1 ,"
"ReLU 175 1 1 174 175 ,"
"InnerProduct 177 1 1 175 177 96 1 0 1 ,"
"HardSigmoid 182 1 1 177 182 0.166667 0.5 ,"
"Reshape 190 1 1 182 190 0 4 4 0 96 1 1 ,"
"Mul 191 2 1 161 190 191 ,"
"ReLU 192 1 1 191 192 ,"
"Convolution 194 1 1 192 194 1 96 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 195 1 1 194 195 1 32 128 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 196 1 1 195 196 ,"
"Convolution 197 1 1 196 197 128 1 128 3 3 2 2 1 1 0 -1 1 1 ,"
"ReLU 198 1 1 197 198 ,"
"Convolution 200 1 1 198 200 1 128 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 201 1 1 200 201 1 48 192 1 1 1 1 0 0 0 -1 1 1 ,"
"HardSwish 207 1 1 201 207 0.166667 0.5 ,"
"Convolution 208 1 1 207 208 192 1 192 3 3 1 1 1 1 0 -1 1 1 ,"
"HardSwish 214 1 1 208 214 0.166667 0.5 ,"
"Convolution 216 1 1 214 216 1 192 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 217 1 1 216 217 1 64 256 1 1 1 1 0 0 0 -1 1 1 ,"
"HardSwish 223 1 1 217 223 0.166667 0.5 ,"
"Convolution 224 1 1 223 224 256 1 256 3 3 1 1 1 1 0 -1 1 1 ,"
"Pooling 231 1 1 224 231 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 235 1 1 231 235 0 4 4 0 256 1 1 ,"
"InnerProduct 237 1 1 235 237 64 1 0 1 ,"
"ReLU 238 1 1 237 238 ,"
"InnerProduct 240 1 1 238 240 256 1 0 1 ,"
"HardSigmoid 245 1 1 240 245 0.166667 0.5 ,"
"Reshape 253 1 1 245 253 0 4 4 0 256 1 1 ,"
"Mul 254 2 1 224 253 254 ,"
"HardSwish 260 1 1 254 260 0.166667 0.5 ,"
"Convolution 262 1 1 260 262 1 256 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 263 1 1 262 263 1 96 384 1 1 1 1 0 0 0 -1 1 1 ,"
"HardSwish 269 1 1 263 269 0.166667 0.5 ,"
"Convolution 270 1 1 269 270 384 1 384 3 3 1 1 1 1 0 -1 1 1 ,"
"Pooling 277 1 1 270 277 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 281 1 1 277 281 0 4 4 0 384 1 1 ,"
"InnerProduct 283 1 1 281 283 96 1 0 1 ,"
"ReLU 284 1 1 283 284 ,"
"InnerProduct 286 1 1 284 286 384 1 0 1 ,"
"HardSigmoid 291 1 1 286 291 0.166667 0.5 ,"
"Reshape 299 1 1 291 299 0 4 4 0 384 1 1 ,"
"Mul 300 2 1 270 299 300 ,"
"HardSwish 306 1 1 300 306 0.166667 0.5 ,"
"Convolution 308 1 1 306 308 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 309 2 1 262 308 309 ,"
"Convolution 310 1 1 309 310 1 96 576 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 311 1 1 310 311 ,"
"Convolution 312 1 1 311 312 576 1 576 3 3 2 2 1 1 0 -1 1 1 ,"
"ReLU 313 1 1 312 313 ,"
"Convolution 315 1 1 313 315 1 576 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 316 1 1 315 316 1 128 768 1 1 1 1 0 0 0 -1 1 1 ,"
"ReLU 317 1 1 316 317 ,"
"Convolution 318 1 1 317 318 768 1 768 3 3 1 1 1 1 0 -1 1 1 ,"
"ReLU 319 1 1 318 319 ,"
"Convolution 321 1 1 319 321 1 768 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 322 2 1 315 321 322 ,"
"Convolution 323 1 1 322 323 1 128 768 1 1 1 1 0 0 0 -1 1 1 ,"
"HardSwish 329 1 1 323 329 0.166667 0.5 ,"
"Convolution 330 1 1 329 330 768 1 768 3 3 1 1 1 1 0 -1 1 1 ,"
"Pooling 337 1 1 330 337 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 341 1 1 337 341 0 4 4 0 768 1 1 ,"
"InnerProduct 343 1 1 341 343 192 1 0 1 ,"
"ReLU 344 1 1 343 344 ,"
"InnerProduct 346 1 1 344 346 768 1 0 1 ,"
"HardSigmoid 351 1 1 346 351 0.166667 0.5 ,"
"Reshape 359 1 1 351 359 0 4 4 0 768 1 1 ,"
"Mul 360 2 1 330 359 360 ,"
"HardSwish 366 1 1 360 366 0.166667 0.5 ,"
"Convolution 368 1 1 366 368 1 768 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 369 2 1 322 368 369 ,"
"Convolution 370 1 1 369 370 1 128 768 1 1 1 1 0 0 0 -1 1 1 ,"
"HardSwish 376 1 1 370 376 0.166667 0.5 ,"
"ReduceMean 377 1 1 160 377 0 3 ,"
"ReduceMean 378 1 1 377 378 0 2 ,"
"ReduceMean 379 1 1 269 379 0 3 ,"
"ReduceMean 380 1 1 379 380 0 2 ,"
"ReduceMean 381 1 1 376 381 0 3 ,"
"ReduceMean 382 1 1 381 382 0 2 ,"
"Concat 383 3 1 378 380 382 383 1 ,"
"InnerProduct 384 1 1 383 384 236 1 0 1 ,"
