"1 106 1 4206624770 ,"
"x.1 1 3 192 192 ,"
" 114 115 117 118 119 120 122 123 124 125 127 128 129 130 131 132 133 135 136 137 138 140 141 142 143 145 146 147 148 149 150 151 153 154 155 156 158 159 160 161 163 164 165 166 167 168 169 171 172 173 174 176 177 178 179 181 182 183 184 185 186 188 189 190 191 193 194 195 196 198 199 200 201 202 203 205 206 207 208 210 211 212 213 215 216 218 219 220 221 223 224 225 226 227 228 230 231 233 234 235 236 238 239 240 241 x.1 ,"
"240 241 ,"
" 105 ,"
"Pad Pad_0 1 1 x.1 114 0 0 0 1 0 1 0 0 0 0 ,"
"Convolution Conv_1 1 1 114 115 1 3 16 3 3 2 2 0 0 1 -1 1 1 ,"
"PReLU PRelu_2 1 1 115 117 0 0 ,"
"Convolution Conv_3 1 1 117 118 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_4 1 1 118 119 1 16 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_5 2 1 119 117 120 ,"
"PReLU PRelu_6 1 1 120 122 0 0 ,"
"Convolution Conv_7 1 1 122 123 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_8 1 1 123 124 1 16 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_9 2 1 124 122 125 ,"
"PReLU PRelu_10 1 1 125 127 0 0 ,"
"Pad Pad_11 1 1 127 128 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_12 1 1 127 129 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_13 1 1 129 130 0 0 0 0 0 0 0 16 0 0 ,"
"Convolution Conv_14 1 1 128 131 16 1 16 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_15 1 1 131 132 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_16 2 1 132 130 133 ,"
"PReLU PRelu_17 1 1 133 135 0 0 ,"
"Convolution Conv_18 1 1 135 136 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_19 1 1 136 137 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_20 2 1 137 135 138 ,"
"PReLU PRelu_21 1 1 138 140 0 0 ,"
"Convolution Conv_22 1 1 140 141 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_23 1 1 141 142 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_24 2 1 142 140 143 ,"
"PReLU PRelu_25 1 1 143 145 0 0 ,"
"Pad Pad_26 1 1 145 146 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_27 1 1 145 147 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_28 1 1 147 148 0 0 0 0 0 0 0 32 0 0 ,"
"Convolution Conv_29 1 1 146 149 32 1 32 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_30 1 1 149 150 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_31 2 1 150 148 151 ,"
"PReLU PRelu_32 1 1 151 153 0 0 ,"
"Convolution Conv_33 1 1 153 154 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_34 1 1 154 155 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_35 2 1 155 153 156 ,"
"PReLU PRelu_36 1 1 156 158 0 0 ,"
"Convolution Conv_37 1 1 158 159 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_38 1 1 159 160 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_39 2 1 160 158 161 ,"
"PReLU PRelu_40 1 1 161 163 0 0 ,"
"Pad Pad_41 1 1 163 164 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_42 1 1 163 165 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_43 1 1 165 166 0 0 0 0 0 0 0 64 0 0 ,"
"Convolution Conv_44 1 1 164 167 64 1 64 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_45 1 1 167 168 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_46 2 1 168 166 169 ,"
"PReLU PRelu_47 1 1 169 171 0 0 ,"
"Convolution Conv_48 1 1 171 172 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_49 1 1 172 173 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_50 2 1 173 171 174 ,"
"PReLU PRelu_51 1 1 174 176 0 0 ,"
"Convolution Conv_52 1 1 176 177 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_53 1 1 177 178 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_54 2 1 178 176 179 ,"
"PReLU PRelu_55 1 1 179 181 0 0 ,"
"Pad Pad_56 1 1 181 182 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_57 1 1 181 183 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Convolution Conv_58 1 1 182 184 128 1 128 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_59 1 1 184 185 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_60 2 1 185 183 186 ,"
"PReLU PRelu_61 1 1 186 188 0 0 ,"
"Convolution Conv_62 1 1 188 189 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_63 1 1 189 190 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_64 2 1 190 188 191 ,"
"PReLU PRelu_65 1 1 191 193 0 0 ,"
"Convolution Conv_66 1 1 193 194 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_67 1 1 194 195 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_68 2 1 195 193 196 ,"
"PReLU PRelu_69 1 1 196 198 0 0 ,"
"Pad Pad_70 1 1 198 199 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_71 1 1 198 200 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Convolution Conv_72 1 1 199 201 128 1 128 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_73 1 1 201 202 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_74 2 1 202 200 203 ,"
"PReLU PRelu_75 1 1 203 205 0 0 ,"
"Convolution Conv_76 1 1 205 206 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_77 1 1 206 207 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_78 2 1 207 205 208 ,"
"PReLU PRelu_79 1 1 208 210 0 0 ,"
"Convolution Conv_80 1 1 210 211 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_81 1 1 211 212 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_82 2 1 210 212 213 ,"
"PReLU PRelu_83 1 1 213 215 0 0 ,"
"Convolution Conv_84 1 1 215 216 1 128 32 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_85 1 1 216 218 0 0 ,"
"Convolution Conv_86 1 1 218 219 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_87 1 1 219 220 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_88 2 1 218 220 221 ,"
"PReLU PRelu_89 1 1 221 223 0 0 ,"
"Convolution Conv_90 1 1 223 224 1 32 1404 3 3 3 3 0 0 1 -1 1 1 ,"
"Convolution Conv_91 1 1 198 225 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"Convolution Conv_92 1 1 225 226 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"Pooling MaxPool_93 1 1 198 227 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Add Add_94 2 1 226 227 228 ,"
"PReLU PRelu_95 1 1 228 230 0 0 ,"
"Convolution Conv_96 1 1 230 231 1 128 32 1 1 1 1 0 0 1 -1 1 1 ,"
"PReLU PRelu_97 1 1 231 233 0 0 ,"
"Convolution Conv_98 1 1 233 234 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_99 1 1 234 235 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_100 2 1 233 235 236 ,"
"PReLU PRelu_101 1 1 236 238 0 0 ,"
"Convolution Conv_102 1 1 238 239 1 32 1 3 3 3 3 0 0 1 -1 1 1 ,"
"Permute Transpose_103 1 1 224 240 4 0 2 3 1 ,"
"Permute Transpose_104 1 1 239 241 4 0 2 3 1 ,"
