"1 143 1 4206624772 ,"
"input.1 4 1 3 224 224 0 ,"
" 412 414 416 418 420 421 423 425 427 429 431 433 435 437 439 441 442 444 446 448 450 452 454 456 458 460 462 463 465 467 469 471 473 474 476 478 480 482 484 486 488 490 492 494 495 497 499 501 503 505 506 508 510 512 514 516 517 519 521 523 525 527 529 531 533 535 537 538 540 542 544 546 548 549 551 553 555 557 559 561 563 565 567 569 570 572 574 576 578 580 581 582 583 585 587 589 591 593 594 595 596 598 600 602 604 606 607 608 609 611 613 615 617 619 620 621 622 624 626 628 630 632 633 634 635 637 638 640 641 642 643 644 645 646 647 648 649 650 651 652 653 654 input.1 ,"
"654 ,"
" 128 ,"
"Convolution Conv_0 1 1 input.1 412 1 3 8 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_2 1 1 412 414 1 0 ,"
"Convolution Conv_3 1 1 414 416 8 1 8 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_5 1 1 416 418 1 0 ,"
"Convolution Conv_6 1 1 418 420 1 8 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_8 2 1 414 420 421 1 ,"
"Convolution Conv_9 1 1 421 423 1 8 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_11 1 1 423 425 1 0 ,"
"Convolution Conv_12 1 1 425 427 24 1 24 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_14 1 1 427 429 1 0 ,"
"Convolution Conv_15 1 1 429 431 1 24 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_17 1 1 431 433 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_19 1 1 433 435 1 0 ,"
"Convolution Conv_20 1 1 435 437 48 1 48 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_22 1 1 437 439 1 0 ,"
"Convolution Conv_23 1 1 439 441 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_25 2 1 431 441 442 1 ,"
"Convolution Conv_26 1 1 442 444 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_28 1 1 444 446 1 0 ,"
"Convolution Conv_29 1 1 446 448 48 1 48 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_31 1 1 448 450 1 0 ,"
"Convolution Conv_32 1 1 450 452 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_34 1 1 452 454 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_36 1 1 454 456 1 0 ,"
"Convolution Conv_37 1 1 456 458 48 1 48 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_39 1 1 458 460 1 0 ,"
"Convolution Conv_40 1 1 460 462 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_42 2 1 452 462 463 1 ,"
"Convolution Conv_43 1 1 463 465 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_45 1 1 465 467 1 0 ,"
"Convolution Conv_46 1 1 467 469 48 1 48 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_48 1 1 469 471 1 0 ,"
"Convolution Conv_49 1 1 471 473 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_51 2 1 463 473 474 1 ,"
"Convolution Conv_52 1 1 474 476 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_54 1 1 476 478 1 0 ,"
"Convolution Conv_55 1 1 478 480 48 1 48 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_57 1 1 480 482 1 0 ,"
"Convolution Conv_58 1 1 482 484 1 48 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_60 1 1 484 486 1 32 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_62 1 1 486 488 1 0 ,"
"Convolution Conv_63 1 1 488 490 96 1 96 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_65 1 1 490 492 1 0 ,"
"Convolution Conv_66 1 1 492 494 1 96 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_68 2 1 484 494 495 1 ,"
"Convolution Conv_69 1 1 495 497 1 32 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_71 1 1 497 499 1 0 ,"
"Convolution Conv_72 1 1 499 501 96 1 96 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_74 1 1 501 503 1 0 ,"
"Convolution Conv_75 1 1 503 505 1 96 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_77 2 1 495 505 506 1 ,"
"Convolution Conv_78 1 1 506 508 1 32 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_80 1 1 508 510 1 0 ,"
"Convolution Conv_81 1 1 510 512 96 1 96 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_83 1 1 512 514 1 0 ,"
"Convolution Conv_84 1 1 514 516 1 96 32 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_86 2 1 506 516 517 1 ,"
"Convolution Conv_87 1 1 517 519 1 32 96 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_89 1 1 519 521 1 0 ,"
"Convolution Conv_90 1 1 521 523 96 1 96 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_92 1 1 523 525 1 0 ,"
"Convolution Conv_93 1 1 525 527 1 96 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_95 1 1 527 529 1 48 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_97 1 1 529 531 1 0 ,"
"Convolution Conv_98 1 1 531 533 144 1 144 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_100 1 1 533 535 1 0 ,"
"Convolution Conv_101 1 1 535 537 1 144 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_103 2 1 527 537 538 1 ,"
"Convolution Conv_104 1 1 538 540 1 48 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_106 1 1 540 542 1 0 ,"
"Convolution Conv_107 1 1 542 544 144 1 144 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_109 1 1 544 546 1 0 ,"
"Convolution Conv_110 1 1 546 548 1 144 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_112 2 1 538 548 549 1 ,"
"Convolution Conv_113 1 1 549 551 1 48 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_115 1 1 551 553 1 0 ,"
"Convolution Conv_116 1 1 553 555 144 1 144 3 3 2 2 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_118 1 1 555 557 1 0 ,"
"Convolution Conv_119 1 1 557 559 1 144 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Convolution Conv_121 1 1 559 561 1 64 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_123 1 1 561 563 1 0 ,"
"Convolution Conv_124 1 1 563 565 192 1 192 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_126 1 1 565 567 1 0 ,"
"Convolution Conv_127 1 1 567 569 1 192 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_129 2 1 559 569 570 1 ,"
"Convolution Conv_130 1 1 570 572 1 64 192 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_132 1 1 572 574 1 0 ,"
"Convolution Conv_133 1 1 574 576 192 1 192 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_135 1 1 576 578 1 0 ,"
"Convolution Conv_136 1 1 578 580 1 192 64 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_138 2 1 570 580 581 1 ,"
"Deconvolution ConvTranspose_139 1 1 581 582 1 64 48 4 4 2 2 1 1 1 -1 1 1 0 ,"
"Add Add_140 2 1 582 549 583 1 ,"
"Convolution Conv_141 1 1 583 585 1 48 144 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_143 1 1 585 587 1 0 ,"
"Convolution Conv_144 1 1 587 589 144 1 144 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_146 1 1 589 591 1 0 ,"
"Convolution Conv_147 1 1 591 593 1 144 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_149 2 1 583 593 594 1 ,"
"Deconvolution ConvTranspose_150 1 1 594 595 1 48 16 4 4 2 2 1 1 1 -1 1 1 0 ,"
"Add Add_151 2 1 595 474 596 1 ,"
"Convolution Conv_152 1 1 596 598 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_154 1 1 598 600 1 0 ,"
"Convolution Conv_155 1 1 600 602 48 1 48 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_157 1 1 602 604 1 0 ,"
"Convolution Conv_158 1 1 604 606 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_160 2 1 596 606 607 1 ,"
"Deconvolution ConvTranspose_161 1 1 607 608 1 16 16 4 4 2 2 1 1 1 -1 1 1 0 ,"
"Add Add_162 2 1 608 442 609 1 ,"
"Convolution Conv_163 1 1 609 611 1 16 48 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_165 1 1 611 613 1 0 ,"
"Convolution Conv_166 1 1 613 615 48 1 48 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_168 1 1 615 617 1 0 ,"
"Convolution Conv_169 1 1 617 619 1 48 16 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_171 2 1 609 619 620 1 ,"
"Deconvolution ConvTranspose_172 1 1 620 621 1 16 8 4 4 2 2 1 1 1 -1 1 1 0 ,"
"Add Add_173 2 1 621 421 622 1 ,"
"Convolution Conv_174 1 1 622 624 1 8 24 1 1 1 1 0 0 1 -1 1 1 0 ,"
"PReLU PRelu_176 1 1 624 626 1 0 ,"
"Convolution Conv_177 1 1 626 628 24 1 24 3 3 1 1 1 1 1 -1 1 1 0 ,"
"PReLU PRelu_179 1 1 628 630 1 0 ,"
"Convolution Conv_180 1 1 630 632 1 24 8 1 1 1 1 0 0 1 -1 1 1 0 ,"
"Add Add_182 2 1 622 632 633 1 ,"
"Convolution Conv_183 1 1 633 634 1 8 3 3 3 1 1 1 1 1 -1 1 1 0 ,"
"Upsample Upsample_200 2 1 634 650 651 2 2 2 1 ,"
"Permute Transpose_201 1 1 651 652 4 0 3 2 1 ,"
"SoftmaxCaffe Softmax_202 1 1 652 653 3 ,"
"Permute Transpose_203 1 1 653 654 4 0 2 1 3 ,"
