{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "Conv1_relu_output",
      "blob_weights" : 3,
      "K" : 1,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "Conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_depthwise_relu_output",
      "blob_weights" : 7,
      "K" : 8,
      "blob_biases" : 5,
      "name" : "expanded_conv_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 8,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "Conv1_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "expanded_conv_project_BN_output",
      "blob_weights" : 11,
      "K" : 8,
      "blob_biases" : 9,
      "name" : "expanded_conv_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "expanded_conv_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_expand_relu_output",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "block_1_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "expanded_conv_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_depthwise_relu_output",
      "blob_weights" : 19,
      "K" : 96,
      "blob_biases" : 17,
      "stride_x" : 2,
      "name" : "block_1_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_1_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_1_project_BN_output",
      "blob_weights" : 23,
      "K" : 96,
      "blob_biases" : 21,
      "name" : "block_1_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_1_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_expand_relu_output",
      "blob_weights" : 27,
      "K" : 16,
      "blob_biases" : 25,
      "name" : "block_2_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_1_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_depthwise_relu_output",
      "blob_weights" : 31,
      "K" : 96,
      "blob_biases" : 29,
      "name" : "block_2_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_2_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_2_project_BN_output",
      "blob_weights" : 35,
      "K" : 96,
      "blob_biases" : 33,
      "name" : "block_2_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "block_2_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_1_project_BN_output,block_2_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_2_add_output",
      "type" : "elementwise",
      "name" : "block_2_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_expand_relu_output",
      "blob_weights" : 39,
      "K" : 16,
      "blob_biases" : 37,
      "name" : "block_3_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_2_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_depthwise_relu_output",
      "blob_weights" : 43,
      "K" : 96,
      "blob_biases" : 41,
      "stride_x" : 2,
      "name" : "block_3_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 96,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 96,
      "bottom" : "block_3_expand_relu_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_3_project_BN_output",
      "blob_weights" : 47,
      "K" : 96,
      "blob_biases" : 45,
      "name" : "block_3_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_3_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_expand_relu_output",
      "blob_weights" : 51,
      "K" : 24,
      "blob_biases" : 49,
      "name" : "block_4_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_3_project_BN_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_depthwise_relu_output",
      "blob_weights" : 55,
      "K" : 144,
      "blob_biases" : 53,
      "name" : "block_4_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_4_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_4_project_BN_output",
      "blob_weights" : 59,
      "K" : 144,
      "blob_biases" : 57,
      "name" : "block_4_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_4_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_3_project_BN_output,block_4_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_4_add_output",
      "type" : "elementwise",
      "name" : "block_4_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_expand_relu_output",
      "blob_weights" : 63,
      "K" : 24,
      "blob_biases" : 61,
      "name" : "block_5_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_4_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_depthwise_relu_output",
      "blob_weights" : 67,
      "K" : 144,
      "blob_biases" : 65,
      "name" : "block_5_depthwise",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 144,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_5_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_5_project_BN_output",
      "blob_weights" : 71,
      "K" : 144,
      "blob_biases" : 69,
      "name" : "block_5_project",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "block_5_depthwise_relu_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : 1,
      "bottom" : "block_4_add_output,block_5_project_BN_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "block_5_add_output",
      "type" : "elementwise",
      "name" : "block_5_add",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block_6_expand_relu_output",
      "blob_weights" : 75,
      "K" : 24,
      "blob_biases" : 73,
      "name" : "block_6_expand",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 144,
      "bottom" : "block_5_add_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "global_average_pooling2d_3_output",
      "size_x" : 8,
      "is_global" : 1,
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "global_average_pooling2d_3",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "block_3_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 8,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "global_average_pooling2d_4_output",
      "size_x" : 4,
      "is_global" : 1,
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "global_average_pooling2d_4",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "block_6_expand_relu_output",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 4,
      "pad_value" : 0
    },
    {
      "weights" : {

      },
      "top" : "concatenate_2_output",
      "type" : "concat",
      "name" : "concatenate_2",
      "bottom" : "global_average_pooling2d_3_output,global_average_pooling2d_4_output"
    },
    {
      "nB" : 240,
      "top" : "output1",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 8,
      "blob_weights" : 79,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "concatenate_2_output",
      "blob_biases" : 77,
      "has_tanh" : 0,
      "name" : "dense_2",
      "has_prelu" : 0
    }
  ]
}